#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/uux0vy-dev/runs/run-mBzWZbhhcZccWDfg

Waiting for the plan to start...

Terraform v1.1.4
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
tls_private_key.private_key: Refreshing state... [id=93189a6e1018f93458f245bce5913f7380af26c8]
aws_cloudfront_function.request: Refreshing state... [id=ien-dev-cf-request]
aws_cloudfront_function.response: Refreshing state... [id=ien-dev-cf-response]
aws_cloudwatch_log_group.api_gateway: Refreshing state... [id=api-gw/ien-dev-api/logs]
aws_s3_bucket.app: Refreshing state... [id=ien-dev-app]
aws_key_pair.key_pair: Refreshing state... [id=ien-dev-key]
aws_ssm_parameter.public_key_ssm_param: Refreshing state... [id=/ien-dev/public-key]
aws_ssm_parameter.private_key_ssm_param: Refreshing state... [id=/ien-dev/private-key]
aws_ssm_parameter.public_key_openssh_ssm_param: Refreshing state... [id=/ien-dev/public-key-openssh]
aws_iam_instance_profile.ec2_instance_profile: Refreshing state... [id=ien-dev-ec2-role]
aws_cloudfront_origin_access_identity.app: Refreshing state... [id=E2IVILJXHTCWXZ]
aws_iam_role.lambda: Refreshing state... [id=ien-dev-lambda]
aws_apigatewayv2_api.api: Refreshing state... [id=h42aam618b]
aws_iam_role_policy_attachment.lambda_cloudwatch: Refreshing state... [id=ien-dev-lambda-20220401150128722800000004]
aws_iam_role_policy_attachment.lambda_execute: Refreshing state... [id=ien-dev-lambda-20220401150128751600000005]
aws_iam_role_policy_attachment.lambda_s3: Refreshing state... [id=ien-dev-lambda-20220401150128719700000003]
aws_iam_role_policy_attachment.lambda_sqs: Refreshing state... [id=ien-dev-lambda-20220401150128718800000002]
aws_iam_role_policy_attachment.lambda_vpc: Refreshing state... [id=ien-dev-lambda-20220401150128716700000001]
aws_apigatewayv2_stage.api: Refreshing state... [id=$default]
aws_db_subnet_group.pgsql: Refreshing state... [id=pgsql]
aws_instance.bastion_instance: Refreshing state... [id=i-034ea94f4c4c6c071]
aws_rds_cluster.pgsql: Refreshing state... [id=ien-dev-db]
aws_s3_bucket_policy.app: Refreshing state... [id=ien-dev-app]
aws_cloudfront_distribution.app: Refreshing state... [id=EM85EBT6QA4PS]
aws_rds_cluster_instance.pgsql[0]: Refreshing state... [id=ien-dev-db-0]
aws_lambda_function.api: Refreshing state... [id=ien-dev-api]
aws_lambda_permission.api_allow_gateway: Refreshing state... [id=terraform-20220401150623852600000001]
aws_apigatewayv2_integration.api: Refreshing state... [id=d0ksdj8]
aws_apigatewayv2_route.api: Refreshing state... [id=jkgaazn]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_lambda_function.api has changed
  ~ resource "aws_lambda_function" "api" {
        id                             = "ien-dev-api"
      ~ last_modified                  = "2022-04-12T16:57:49.000+0000" -> "2022-04-12T17:00:20.000+0000"
      ~ source_code_hash               = "sbL6NPSUeaDtS8bchKWVICU+Fdqc8yJqL9NNexyefkU=" -> "AE7+OYS0KQIcrlR6BM16LyjKRW6/OHgQbhsA253ZOuc="
      ~ source_code_size               = 49008992 -> 49012324
        tags                           = {}
        # (22 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudfront_function.response will be updated in-place
  ~ resource "aws_cloudfront_function" "response" {
      ~ code    = <<-EOT
            function handler(event) {
              var response = event.response;
              var headers = response.headers;
            
              // Set HTTP security headers
              // Since JavaScript doesn't allow for hyphens in variable names, we use the dict["key"] notation
              headers['strict-transport-security'] = { value: 'max-age=63072000; includeSubdomains; preload' };
              headers['content-security-policy'] = {
                value:
          -       "default-src 'self' https://keycloak.freshworks.club; img-src 'self'; style-src 'self' 'unsafe-inline'; script-src 'self' 'unsafe-eval'; form-action 'self'; frame-ancestors 'self'",
          +       "default-src 'self' https://common-logon-dev.hlth.gov.bc.ca/auth; img-src 'self'; style-src 'self' 'unsafe-inline'; script-src 'self' 'unsafe-eval'; form-action 'self'; frame-ancestors 'self'",
              };
              headers['x-content-type-options'] = { value: 'nosniff' };
              headers['x-frame-options'] = { value: 'DENY' };
              headers['x-xss-protection'] = { value: '1; mode=block' };
              headers['x-download-options'] = { value: 'noopen' };
              headers['server'] = { value: '*' };
              headers['cache-control'] = { value: 'no-store' };
              // Return the response to viewers
              return response;
            }
        EOT
        id      = "ien-dev-cf-response"
        name    = "ien-dev-cf-response"
        # (6 unchanged attributes hidden)
    }

  # aws_instance.bastion_instance must be replaced
-/+ resource "aws_instance" "bastion_instance" {
      ~ ami                                  = "ami-0cfc8f6b6d827ff08" -> "ami-034b13e2ca94e7832" # forces replacement
      ~ arn                                  = "arn:aws:ec2:ca-central-1:588188670678:instance/i-034ea94f4c4c6c071" -> (known after apply)
      ~ availability_zone                    = "ca-central-1b" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      ~ id                                   = "i-034ea94f4c4c6c071" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      - monitoring                           = false -> null
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ primary_network_interface_id         = "eni-07cd28e4e64519f32" -> (known after apply)
      ~ private_dns                          = "ip-10-12-127-182.ca-central-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.12.127.182" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
        tags                                 = {
            "Name" = "ien-dev-bastion"
        }
      ~ tenancy                              = "default" -> (known after apply)
        # (10 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          ~ kms_key_id            = "arn:aws:kms:ca-central-1:588188670678:key/59071ae1-5eab-4942-b7cb-e315b232f0c3" -> (known after apply)
          - tags                  = {} -> null
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0676282eb57283cb4" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # aws_lambda_function.api will be updated in-place
  ~ resource "aws_lambda_function" "api" {
        id                             = "ien-dev-api"
        tags                           = {}
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "AUTH_RELM"         = "moh_applications"
              + "AUTH_URL"          = "https://common-logon-dev.hlth.gov.bc.ca/auth"
              ~ "BUILD_ID"          = "5020c8e" -> "27ab9f0"
              ~ "BUILD_INFO"        = "5020c8e, GitHub, IEN-4-IEN-33-search-applicants-filter-tabs-and-pagination-49, grafted, HEAD, tag: refs/tags/dev" -> "27ab9f0, GitHub, Merge-3da6fdcff6de7a306f9444bd798294cc16151bb6-into-8ac70eccb3b7a8c9f7b3e5226e2d15293b669327, grafted, HEAD, refs/remotes/pull/57/merge"
                # (10 unchanged elements hidden)
            }
        }


        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.


------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 2 of 9 estimated
           $226.3600000000000008/mo +$0.0

```

</details>